[MecRuler_Rifle X2WeaponTemplate]
FriendlyName="ADVENT Spark Cannon"
FriendlyNamePlural="ADVENT Spark Cannons"

[MecRulerMicroMissiles X2AbilityTemplate]
LocFriendlyName="Micro Missiles"
LocLongDescription="The MEC's shoulder mounted missile launcher can volley a salvo of missiles dealing high damage that knockbacks and disorients its foes."
LocHelpText="Target an area with an explosive missile attack."

[TRAdvSparkMicroMissiles X2AbilityTemplate]
LocFriendlyName="Micro Missiles"
LocLongDescription="The MEC's shoulder mounted missile launcher can volley a salvo of missiles dealing high damage that knockbacks and disorients its foes."
LocHelpText="Target an area with an explosive missile attack."

[MecRulerArmorRepairModule X2AbilityTemplate]
LocFriendlyName="Armor Repair Module"
LocLongDescription="Gains the ability to automatically repair shredded armors."
LocHelpText="Gains the ability to automatically repair shredded armors."

[MecRulerBSDamageReductionModule X2AbilityTemplate]
LocFriendlyName="Enhanced Firewall Module"
LocLongDescription="Reduces damage taken from Bluescreen-like effects."
LocHelpText="Reduces damage taken from Bluescreen-like effects."

[MecRulerMeleeResistanceModule X2AbilityTemplate]
LocFriendlyName="Predictive Close Quarters Module"
LocLongDescription="Reduces damage taken from melee attacks."
LocHelpText="Reduces damage taken from melee attacks."

[MecRulerStrike X2AbilityTemplate]
LocFriendlyName="Ruler Strike"
LocLongDescription="Attack any enemy within movement range with a powerful melee attack."
LocHelpText="Attack any enemy within movement range with a powerful melee attack."

[CTDRoundsShieldBurst X2AbilityTemplate]
LocFriendlyName="Shield Surge"
LocLongDescription="Triggers a surge to unit's shield, causing additional damage."
LocHelpText="Triggers a surge to unit's shield, causing additional damage."

[MecRulerRootProtocolShot X2AbilityTemplate]
LocFriendlyName="Ruler Root Protocol"
LocFlyOverText="Rooted"
LocLongDescription="Roots a unit to its current position."
LocHelpText="Roots a unit to its current position."

[MecRulerArmor_XCOM_TorsoPart X2BodyPartTemplate]
DisplayName="ADVENT SPARK Chassis"

[CTDRounds X2AmmoTemplate]
FriendlyName="CTD Rounds"
FriendlyNamePlural="CTD Rounds"
BriefSummary="No prizes for the right guess to what CTD means; this rounds wreck havoc on robotic units. Though not as effective as our own Bluescreen rounds, it does additional damage to units with Shield HP."
TacticalText="<Bullet/> These rounds contain disruptive EMP microburst tech, making them effective against robotic opponents.<br>"
